MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX570F512L.atdf
         <register caption="Peripheral Pin Select Input Register" name="IC1R" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC1R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC2R" offset="0x28" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC2R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC3R" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC3R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC4R" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC4R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC5R" offset="0x34" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC5R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC6R" offset="0x38" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC6R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC7R" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC7R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC8R" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC8R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="OCFAR" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="OCFAR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="OCFBR" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="OCFBR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U1RXR" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U1CTSR" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1CTSR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U2RXR" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U2CTSR" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2CTSR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U3RXR" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U3RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U3CTSR" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U3CTSR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U4RXR" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U4RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U4CTSR" offset="0x68" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U4CTSR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U5RXR" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U5RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U5CTSR" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U5CTSR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U6RXR" offset="0x74" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U6RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U6CTSR" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U6CTSR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SDI1R" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI1R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SS1R" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS1R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SDI2R" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI2R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SS2R" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS2R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SDI3R" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI3R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SS3R" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS3R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SDI4R" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI4R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SS4R" offset="0xa8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS4R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SDI5R" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI5R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SS5R" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS5R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SDI6R" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI6R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="SS6R" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS6R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="C1RXR" offset="0xc4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C1RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="C2RXR" offset="0xc8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C2RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="REFCLKIR" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFCLKIR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="REFI2R" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFI2R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="REFI3R" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFI3R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="REFI4R" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFI4R" />
         </register>
      </register-group>
   </module>
   <module caption="" id="02495" name="RPOR" version="">
      <register-group name="RPOR">
         <register caption="" name="RPA0R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA0R" />
         </register>
         <register caption="" name="RPA1R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA1R" />
         </register>
         <register caption="" name="RPA2R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA2R" />
         </register>
         <register caption="" name="RPA3R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA3R" />
         </register>
         <register caption="" name="RPA4R" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA4R" />
         </register>
         <register caption="" name="RPA5R" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA5R" />
         </register>
         <register caption="" name="RPA6R" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA6R" />
         </register>
         <register caption="" name="RPA7R" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA7R" />
         </register>
         <register caption="" name="RPA8R" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA8R" />
         </register>
         <register caption="" name="RPA9R" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA9R" />
         </register>
         <register caption="" name="RPA10R" offset="0x28" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA10R" />
         </register>
